# HostFlagAreaOff Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..HostFlagAreaOff Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HostFlagAreaOff { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostFlagAreaOff As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HostFlagAreaOff {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace